In [1]:
# Import packages

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
# Creating series ds from list

x=['Shreenidhi','Ganesh','Tarak','Mrithyunjay','Kevin']
name=pd.Series(x)
name

0     Shreenidhi
1         Ganesh
2          Tarak
3    Mrithyunjay
4          Kevin
dtype: object

In [3]:
# Creating json key:value pair in series

y={'Country':['India','Ireland','Denmark','Brazil','Italy']}
kv=pd.Series(y)
kv

Country    [India, Ireland, Denmark, Brazil, Italy]
dtype: object

In [4]:
# Creating series ds from list

L=['English','Kannada','Hindi','Maths','Physics']
lang=pd.Series(L)
lang

0    English
1    Kannada
2      Hindi
3      Maths
4    Physics
dtype: object

In [5]:
# Series ds to DataFrame ds
NAMES=pd.DataFrame(name)
NAMES

             0
0   Shreenidhi
1       Ganesh
2        Tarak
3  Mrithyunjay
4        Kevin

In [6]:
# Series ds to DataFrame ds
kyvl=pd.DataFrame(kv)
kyvl

                                                0
Country  [India, Ireland, Denmark, Brazil, Italy]

In [7]:
# Series ds to DataFrame ds
language=pd.DataFrame(lang)
language

         0
0  English
1  Kannada
2    Hindi
3    Maths
4  Physics

In [8]:
# concatinate 2 DataFrames along columns (axis=1)

cnctc=pd.concat([NAMES,language],axis=1)
cnctc

             0        0
0   Shreenidhi  English
1       Ganesh  Kannada
2        Tarak    Hindi
3  Mrithyunjay    Maths
4        Kevin  Physics

In [9]:
# names for columns

cnctc.columns=['Names','Language']
cnctc

         Names Language
0   Shreenidhi  English
1       Ganesh  Kannada
2        Tarak    Hindi
3  Mrithyunjay    Maths
4        Kevin  Physics

In [10]:
# concatinate 2 DataFrames along rows (axis=0)

cnctr=pd.concat([NAMES,language],axis=0)
cnctr

             0
0   Shreenidhi
1       Ganesh
2        Tarak
3  Mrithyunjay
4        Kevin
0      English
1      Kannada
2        Hindi
3        Maths
4      Physics

In [11]:
# name for column
cnctr.columns=['Unknown']
cnctr

       Unknown
0   Shreenidhi
1       Ganesh
2        Tarak
3  Mrithyunjay
4        Kevin
0      English
1      Kannada
2        Hindi
3        Maths
4      Physics

In [12]:
# One liner for concating

oneliner=pd.DataFrame(list(zip(x,L)))
oneliner

             0        1
0   Shreenidhi  English
1       Ganesh  Kannada
2        Tarak    Hindi
3  Mrithyunjay    Maths
4        Kevin  Physics

In [13]:
# names for columns
oneliner.columns=['Names','Subject']
oneliner

         Names  Subject
0   Shreenidhi  English
1       Ganesh  Kannada
2        Tarak    Hindi
3  Mrithyunjay    Maths
4        Kevin  Physics

## 19_8_21

In [14]:
# Index naming

country=['India','America','China','Africa','England']
cnty=pd.Series(country,index=['aa','bb','cc','dd','ee'])
cnty

aa      India
bb    America
cc      China
dd     Africa
ee    England
dtype: object

In [15]:
cndf=pd.DataFrame(cnty)
cndf

          0
aa    India
bb  America
cc    China
dd   Africa
ee  England

In [16]:
# Retrieve value based from index value

cnty['bb']

'America'

In [39]:
# Retrieve value based from index value

cnty[['ee','dd']]

ee    England
dd     Africa
dtype: object

In [31]:
# Concat two DataFrames with different index value

n=['Akshay','Bharath','Chintan','Dobby','Elina','Farhan']
na=pd.Series(n)
na

0     Akshay
1    Bharath
2    Chintan
3      Dobby
4      Elina
5     Farhan
dtype: object

In [32]:
c=['Amazon','Google','Apple','Delloite','Microsoft']
co=pd.Series(c,index=['a','b','c','d','e'])
co

a       Amazon
b       Google
c        Apple
d     Delloite
e    Microsoft
dtype: object

In [33]:
nam=pd.DataFrame(na)
nam

         0
0   Akshay
1  Bharath
2  Chintan
3    Dobby
4    Elina
5   Farhan

In [34]:
com=pd.DataFrame(co)
com

           0
a     Amazon
b     Google
c      Apple
d   Delloite
e  Microsoft

In [37]:
# Concat two DataFrames with different index value along column

nacm=pd.concat([nam,com],axis=1)
nacm

         0          0
0   Akshay        NaN
1  Bharath        NaN
2  Chintan        NaN
3    Dobby        NaN
4    Elina        NaN
5   Farhan        NaN
a      NaN     Amazon
b      NaN     Google
c      NaN      Apple
d      NaN   Delloite
e      NaN  Microsoft

In [38]:
# Concat two DataFrames with different index value along row

nacmrow=pd.concat([nam,com],axis=0)
nacmrow

           0
0     Akshay
1    Bharath
2    Chintan
3      Dobby
4      Elina
5     Farhan
a     Amazon
b     Google
c      Apple
d   Delloite
e  Microsoft

In [40]:
# Slicing

nacm[1:'d']

         0         0
1  Bharath       NaN
2  Chintan       NaN
3    Dobby       NaN
4    Elina       NaN
5   Farhan       NaN
a      NaN    Amazon
b      NaN    Google
c      NaN     Apple
d      NaN  Delloite

In [42]:
# Reverse Slicing

nacm[::-1]

         0          0
e      NaN  Microsoft
d      NaN   Delloite
c      NaN      Apple
b      NaN     Google
a      NaN     Amazon
5   Farhan        NaN
4    Elina        NaN
3    Dobby        NaN
2  Chintan        NaN
1  Bharath        NaN
0   Akshay        NaN

In [43]:
nacmrow[::-1]

           0
e  Microsoft
d   Delloite
c      Apple
b     Google
a     Amazon
5     Farhan
4      Elina
3      Dobby
2    Chintan
1    Bharath
0     Akshay

In [45]:
nacmrow[2:'e']

           0
2    Chintan
3      Dobby
4      Elina
5     Farhan
a     Amazon
b     Google
c      Apple
d   Delloite
e  Microsoft

In [49]:
n[0:2]

['Akshay', 'Bharath']

In [50]:
print()

         0          0
0   Akshay        NaN
1  Bharath        NaN
2  Chintan        NaN
3    Dobby        NaN
4    Elina        NaN
5   Farhan        NaN
a      NaN     Amazon
b      NaN     Google
c      NaN      Apple
d      NaN   Delloite
e      NaN  Microsoft

In [51]:
print(na)

0     Akshay
1    Bharath
2    Chintan
3      Dobby
4      Elina
5     Farhan
dtype: object

In [56]:
na.name='Students'
print(na)
print(type(na))

0     Akshay
1    Bharath
2    Chintan
3      Dobby
4      Elina
5     Farhan
Name: Students, dtype: object
<class 'pandas.core.series.Series'>

In [57]:
nacm.columns=['Colums1','Column2']
nacm

   Colums1    Column2
0   Akshay        NaN
1  Bharath        NaN
2  Chintan        NaN
3    Dobby        NaN
4    Elina        NaN
5   Farhan        NaN
a      NaN     Amazon
b      NaN     Google
c      NaN      Apple
d      NaN   Delloite
e      NaN  Microsoft

In [60]:
nacm.index.name='Index'
nacm

       Colums1    Column2
Index
0       Akshay        NaN
1      Bharath        NaN
2      Chintan        NaN
3        Dobby        NaN
4        Elina        NaN
5       Farhan        NaN
a          NaN     Amazon
b          NaN     Google
c          NaN      Apple
d          NaN   Delloite
e          NaN  Microsoft

In [63]:
nacm.columns

Index(['Colums1', 'Column2'], dtype='object')

In [66]:
nacm.values

array([['Akshay', nan],
       ['Bharath', nan],
       ['Chintan', nan],
       ['Dobby', nan],
       ['Elina', nan],
       ['Farhan', nan],
       [nan, 'Amazon'],
       [nan, 'Google'],
       [nan, 'Apple'],
       [nan, 'Delloite'],
       [nan, 'Microsoft']], dtype=object)

In [67]:
nacm.size

22

In [68]:
nacm.empty

False

In [69]:
nacm.isnull()

       Colums1  Column2
Index
0        False     True
1        False     True
2        False     True
3        False     True
4        False     True
5        False     True
a         True    False
b         True    False
c         True    False
d         True    False
e         True    False

In [86]:
emp=['One','','']
empy=pd.Series(emp)
empy.empty

False

In [89]:
employ=pd.DataFrame()
employ.empty

True

In [92]:
emp1=['One','','']
emps=pd.Series(emp1)
emps1=pd.DataFrame(emps)
emps1

     0
0  One
1
2

In [93]:
emps1.isnull()

       0
0  False
1  False
2  False